# AlignmentStationLabelSetOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AlignmentStationLabelSetOptions Constructor
AlignmentStationLabelSetOptions Class See Also
---
Create an object with default values.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public AlignmentStationLabelSetOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
AlignmentStationLabelSetOptions()
```

# See Also
AlignmentStationLabelSetOptions Class
Autodesk.Revit.DB.Infrastructure Namespace